### 1. how to find version

In [3]:
import pandas as pd
pd.__version__

'2.3.3'

### another method

In [4]:
import pandas as pd
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 9c8bc3e55188c8aff37207a74f1dd144980b8874
python                : 3.14.2
python-bits           : 64
OS                    : Windows
OS-release            : 11
Version               : 10.0.26200
machine               : AMD64
processor             : AMD64 Family 25 Model 80 Stepping 0, AuthenticAMD
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_United States.1252

pandas                : 2.3.3
numpy                 : 2.4.2
pytz                  : 2025.2
dateutil              : 2.9.0.post0
pip                   : 26.0.1
Cython                : None
sphinx                : None
IPython               : 9.10.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : None
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : 3.1.6
lxml.etree            : None
matplotlib            : 3.10.8
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : 23.0.0
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : 1.17.0
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2025.3
qtpy                  : None
pyqt5                 : None

### 2. To make dataframes

In [5]:
df=pd.DataFrame({'col A' : [1,2,3,4,5,6,7,8,],'col B' :[11,12,13,14,15,16,17,18], 'col C' :[21,22,23,24,25,26,27,28] }) 
df

   col A  col B  col C
0      1     11     21
1      2     12     22
2      3     13     23
3      4     14     24
4      5     15     25
5      6     16     26
6      7     17     27
7      8     18     28

## to make dataFrames using numpy array

In [6]:
#using numpy array to create dataframes
import numpy as np
arr = np.array([[1,2,3], [4,5,6], [7,8,9]]) #A regular Python list can hold different types of things (numbers, text,images etc.) and can be a bit slow for math.A NumPy array is specifically designed for numbers. It's like a super-efficient, super-fast version of a list built for doing math with many numbers at once.
arr
#to convert into this form
pd.DataFrame(arr)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [7]:
# numpy array dataframe
# Create a DataFrame from a NumPy array using pandas
# df = pd.DataFrame(np.random.rand(4, 8))
# print(df)
df=pd.DataFrame(np.random.rand(4, 4))
df

          0         1         2         3
0  0.838425  0.042579  0.092019  0.419041
1  0.752867  0.816282  0.303590  0.408409
2  0.710830  0.269731  0.804815  0.546074
3  0.613695  0.628821  0.482277  0.388379

In [8]:
df=pd.DataFrame(np.random.rand(2, 4), columns=list('abcd'))
df.rename(columns={'a':'A',  'b': 'B', 'c' : 'C', 'd' : 'D' }, inplace=True)
df

          A         B         C         D
0  0.813894  0.376037  0.408812  0.500779
1  0.024354  0.062317  0.475408  0.653633

## how to rename columns

In [9]:
df=pd.DataFrame({'col A' : [1,2,3,4,5,6,7,8,],'col B' :[11,12,13,14,15,16,17,18] }) 
df.rename(columns={'col A' : 'Y','col B' : 'Z' }, inplace=True)  
df

   Y   Z
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15
5  6  16
6  7  17
7  8  18

In [10]:
#OR easy renaming
df.columns=['Col__01', 'Col__02']
df

   Col__01  Col__02
0        1       11
1        2       12
2        3       13
3        4       14
4        5       15
5        6       16
6        7       17
7        8       18

In [11]:
#to replace character or string
df.columns=df.columns.str.replace('__', ' ')
df

   Col 01  Col 02
0       1      11
1       2      12
2       3      13
3       4      14
4       5      15
5       6      16
6       7      17
7       8      18

In [12]:
#To replace again 
df.columns=df.columns.str.replace(' ', '__')
df

   Col__01  Col__02
0        1       11
1        2       12
2        3       13
3        4       14
4        5       15
5        6       16
6        7       17
7        8       18

In [13]:
# Adding suffix to columns
df = df.add_suffix('_end')
df

   Col__01_end  Col__02_end
0            1           11
1            2           12
2            3           13
3            4           14
4            5           15
5            6           16
6            7           17
7            8           18

In [14]:
# Adding prefix to columns
df = df.add_prefix('Baba__')
df

   Baba__Col__01_end  Baba__Col__02_end
0                  1                 11
1                  2                 12
2                  3                 13
3                  4                 14
4                  5                 15
5                  6                 16
6                  7                 17
7                  8                 18

In [15]:
# back to original form after prefix and suffix
df.columns=['col_01','col_02']
df

   col_01  col_02
0       1      11
1       2      12
2       3      13
3       4      14
4       5      15
5       6      16
6       7      17
7       8      18

## 4- Using Tamplet Data

In [16]:
import pandas as pd
import numpy as np 
import seaborn as sns
df = sns.load_dataset('tips')

df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [17]:
#description
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [18]:


# columns names
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [19]:
# saving a dataset
#df.to_csv('tips_dataset.csv')
df.to_excel('tips_dataset.xlsx')

## 5- Using your own data

In [20]:
import pandas as pd
df = pd.read_excel('tips_dataset.xlsx')
df.tail()

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
239         239       29.03  5.92    Male     No   Sat  Dinner     3
240         240       27.18  2.00  Female    Yes   Sat  Dinner     2
241         241       22.67  2.00    Male    Yes   Sat  Dinner     2
242         242       17.82  1.75    Male     No   Sat  Dinner     2
243         243       18.78  3.00  Female     No  Thur  Dinner     2

## 6-Reverse row Order

In [21]:
import seaborn as sns
import pandas as pd
df= sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [22]:
#it will reverse the sequence and will give you the head in reverse order
df.loc[::-1].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [23]:
#it will now just reset the index of df
df.loc[::-1].reset_index(drop=True).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
1,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
2,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
3,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
4,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

## 7-Reverse column Order

In [24]:
df.loc[:,::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

## 8- select a column by data type

In [25]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [26]:
# Only select those having numeric(int,float) type
df.select_dtypes(include=['number']).head()

   survived  pclass   age  sibsp  parch     fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

In [27]:
# Only select those having object type
df.select_dtypes(include=['object']).head()

      sex embarked    who  embark_town alive
0    male        S    man  Southampton    no
1  female        C  woman    Cherbourg   yes
2  female        S  woman  Southampton   yes
3  female        S  woman  Southampton   yes
4    male        S    man  Southampton    no

In [28]:
# Only select those having multiple data type
df.select_dtypes(include=['number', 'object']).head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,embark_town,alive
0,0,3,male,22.0,1,0,7.2500,S,man,Southampton,no
1,1,1,female,38.0,1,0,71.2833,C,woman,Cherbourg,yes
2,1,3,female,26.0,0,0,7.9250,S,woman,Southampton,yes
3,1,1,female,35.0,1,0,53.1000,S,woman,Southampton,yes
4,0,3,male,35.0,0,0,8.0500,S,man,Southampton,no

In [29]:
# Only exclude those having object type
df.select_dtypes(exclude=['object']).head()

,survived,pclass,age,sibsp,parch,fare,class,adult_male,deck,alone
0,0,3,22.0,1,0,7.2500,Third,True,NaN,False
1,1,1,38.0,1,0,71.2833,First,False,C,False
2,1,3,26.0,0,0,7.9250,Third,False,NaN,True
3,1,1,35.0,1,0,53.1000,First,False,C,False
4,0,3,35.0,0,0,8.0500,Third,True,NaN,True

## 09-convert strings into numbers (Type-casting)

In [30]:
import pandas as pd
df = pd.DataFrame({'col_a' : ['1','2','3','4','5'],'col_b' : [6,7,8,9,10]})
df

  col_a  col_b
0     1      6
1     2      7
2     3      8
3     4      9
4     5     10

In [31]:
df.dtypes

col_a    object
col_b     int64
dtype: object

In [32]:
df.astype({'col_a': 'int64','col_b': 'int64'}).dtypes

col_a    int64
col_b    int64
dtype: object

## 10- reduce data frame size

In [33]:
import seaborn as sns
df =sns.load_dataset('titanic')
df.shape

(891, 15)

In [34]:
df.sample(frac=0.2).shape
#when your data is in GBs soo, we then reduced the dataframes into sample

(178, 15)

## 11- Copy data from clip board

In [35]:
import seaborn as sns
import pandas as pd
df= sns.load_dataset('titanic')
df.to_excel('Kashti.xlsx')

In [36]:
# read clipboard in python    #I just copy this line
df= pd.read_clipboard()
df

Empty DataFrame
Columns: [df.groupby(['sex','who','pclass']).count()]
Index: []

## 12-Split dataFrames into two subsets

In [37]:
import seaborn as sns
import pandas as pd
df = sns.load_dataset('titanic')
df.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [38]:
len(df)

891

In [39]:
# From random import random we use 
from random import random
kashti_1 = df.sample(frac=0.5, random_state=1)
kashti_1.shape

(446, 15)

In [40]:
kashti_2 = df.drop(kashti_1.index)  # we are droping kashti_1 from whole df. the rest will give us the kashti_2
kashti_2.shape
kashti_2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [41]:
kashti_1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [42]:
kashti_2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [43]:
len(kashti_1) + len(kashti_2)

891

## 13- Joining two data set

In [44]:
df1 = kashti_1.append(kashti_2)  #this will joined the two kashties
df1.shape

AttributeError: 'DataFrame' object has no attribute 'append'

## 14- Filtering the dataset

In [ ]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [ ]:
df[(df.sex=="male")]
df[(df.age==22) & (df.sex=="female")]

In [ ]:
df[((df.embark_town==('Southampton'))|
(df.embark_town==('Cherbourg'))) &
(df.sex=='female')
   ]

In [ ]:
df[df.embark_town.isin(['Cherbourg','Southampton'])].head()

In [ ]:
df[df.age>30]

## 15-filtering by Large catagory

In [ ]:
df.embark_town.value_counts()
df.sex.value_counts()
df.age.value_counts().nlargest(3)

Index([24.0, 22.0, 18.0], dtype='float64', name='age')

In [ ]:
df.embark_town.value_counts().nlargest(3).index
#OR
count = df.embark_town.value_counts()
count.nlargest(2).index

Index(['Southampton', 'Cherbourg'], dtype='object', name='embark_town')

### 16- Splitting a string into multiple columns

In [ ]:
import pandas as pd
df = pd.DataFrame( {'name' : ['maaz khan','ammar ayaz','kashif haider','atif shah' ],
            'location' : ['malakand, kpk','nowshehra, kpk','kohat, kpk ', 'karak, kpk'] } )
df

            name        location
0      maaz khan   malakand, kpk
1     ammar ayaz  nowshehra, kpk
2  kashif haider     kohat, kpk
3      atif shah      karak, kpk

In [ ]:
#splitting a column into two columns
df.name.str.split(' ',expand=True)

        0       1
0    maaz    khan
1   ammar    ayaz
2  kashif  haider
3    atif    shah

In [ ]:
#adding these split into new Columns
df[['first Name', '2nd name']] = df.name.str.split(' ',expand=True)
df

In [ ]:
df[['city','province']] = df.location.str.split(', ',expand=True)
df

In [ ]:
#refine data manupulation
df[['name', 'location', 'city', 'province']]

### 17- aggregate by multiple groups/function

In [ ]:
import pandas as pd
import seaborn as sns
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
#this shows no. of catagories 
df.groupby('sex').count()
df.groupby('who').count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
who,,,,,,,,,,,,,,
child,83,83,83,83,83,83,83,83,83,83,13,83,83,83
man,537,537,537,413,537,537,537,537,537,537,99,537,537,537
woman,271,271,271,218,271,271,271,269,271,271,91,269,271,271

In [ ]:
len(df.who)

891

In [ ]:
len(df.groupby('who'))

3

In [2]:
df.groupby(['sex','who','pclass']).count()

NameError: name 'df' is not defined

### 18- select specific rows or column

In [ ]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# selecting specific columns
df[['sex','age','pclass']]

        sex   age  pclass
0      male  22.0       3
1    female  38.0       1
2    female  26.0       3
3    female  35.0       1
4      male  35.0       3
..      ...   ...     ...
886    male  27.0       2
887  female  19.0       1
888  female   NaN       3
889    male  26.0       1
890    male  32.0       3

[891 rows x 3 columns]

In [ ]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
# for selecting specific no. of rows
df.describe().loc[['min','25%','50%', '75%', 'max']]
# Or 
df.describe().loc['min' : 'max']

     survived  pclass     age  sibsp  parch      fare
min       0.0     1.0   0.420    0.0    0.0    0.0000
25%       0.0     2.0  20.125    0.0    0.0    7.9104
50%       0.0     3.0  28.000    0.0    0.0   14.4542
75%       1.0     3.0  38.000    1.0    0.0   31.0000
max       1.0     3.0  80.000    8.0    6.0  512.3292

In [ ]:
#to select specific rows and specific columns
df.describe().loc['min' : 'max', ['survived', 'age'] ]
df.describe().loc['min' : 'max', 'survived' : 'parch' ]

     survived  pclass     age  sibsp  parch
min       0.0     1.0   0.420    0.0    0.0
25%       0.0     2.0  20.125    0.0    0.0
50%       0.0     3.0  28.000    0.0    0.0
75%       1.0     3.0  38.000    1.0    0.0
max       1.0     3.0  80.000    8.0    6.0

### 19- Reshape multiIndex series

In [ ]:
df.survived.mean()

np.float64(0.3838383838383838)

In [ ]:
df.groupby('sex').survived.mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [ ]:
df.groupby(['sex','class']).survived.mean().unstack()
#unstack func just for separate class in column

C:\Users\dell\AppData\Local\Temp\ipykernel_14256\3573713894.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex','class']).survived.mean().unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### 20- continuous to catagorical data

In [ ]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
df.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [ ]:
# creating bins   (we are actually converting a range of age to a catagory) using pd.cut func
pd.cut(df.age, bins = [0, 18, 25, 99], labels= ['child','young','adult']).head()
df['new_age'] = pd.cut(df.age, bins = [0, 18, 25, 99], labels= ['child','young','adult']).head()
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

### 21-converting one set of data into another

In [ ]:
df.sex.head()

0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object

In [ ]:
# we are using a dictionary map
df.sex.map({'male':0, 'female': 1})
df['sex_numbered'] = df.sex.map({'male':0, 'female': 1})
df.head()

In [ ]:
df.embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [ ]:
df.embarked.factorize()[0]
df['embarked_numbered']= df.embarked.factorize()[0]
df.head()

## 22-transpose a wide dataframes

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.DataFrame(np.random.rand(100,10), columns=list('abcdefghij'))
df.head()

In [ ]:
# for transpose
df.head().T

In [ ]:
df.describe()   #there are 10 columns and 8 rows it would be better if we transpose both
df.describe().T

### 23- Reshaping a data Frame
not done yet by me ....will try latter In sha Allah